////desc:复习指针常量
////creator: 20210317
////总结：const修饰谁，就不可以对谁进行修改操作。
////const修饰指针： 
////const修饰常量
////const同时修饰指针和常量
//
//#include<iostream>
//using namespace std;
//int main() {
//	int a = 10;
//	int b = 20;

//const修饰指针，叫常量指针
//	//1.常量指针，*p是错误的即指针指向的值不可以改,指针指向可以改
//	const int *p1 = &a;
//	//*p = 20;  //报错，不能给常量赋值，即指针指向的值不可以改，指针的指向可以改
//	p1 = &b;
//	
//const修饰常量，叫指针常量
//	//2.指针常量，操作p是错误的即指向不可以改，指针的值可以改
//	int * const p2 = &a;
//	//p2 = &b; 报错,表达式必须是可以修改的左值 ,指针指向的值可以改，指针指向不可以改
//	*p2 = 30;
//
//	//3.const同时指针和常量,指针指向的值和指针指向都不可以改
//	const int * const p3 = &a;
//	//*p = 30;
//	//p = &b;
//
//	//总结：就近原则
//	return 0;
//}